#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated attribute

  on .terraform/modules/aks/main.tf line 548, in resource "azurerm_kubernetes_cluster" "main":
 548:       public_network_access_enabled,

The attribute "public_network_access_enabled" is deprecated. Refer to the
provider documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.aks.data.azurerm_client_config.this: Reading...
module.aks.data.azurerm_resource_group.main: Reading...
module.aks.data.azurerm_resource_group.aks_rg[0]: Reading...
module.aks.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04ZjhhNDllYS0wYjA5LTRlNGEtODhhNi0xNmY1NzJmZjQ1NDQ7b2JqZWN0SWQ9ZjhmNDg5ODUtNDIzNC00NzdhLWI5MzQtMjAzZTJlMTVmZDBkO3N1YnNjcmlwdGlvbklkPTAwYzg0OWE0LWQ4YjMtNGQ1Ni05NWZlLTlhMmQwYmI0MGU2OTt0ZW5hbnRJZD1hODk0NTBiOS01OGEzLTRlNmEtOTRiMC05Yzc0NmMwY2I1YTY=]
module.aks.data.azurerm_resource_group.main: Read complete after 0s [id=/subscriptions/00c849a4-d8b3-4d56-95fe-9a2d0bb40e69/resourceGroups/rg-team-1-dev]
module.aks.data.azurerm_resource_group.aks_rg[0]: Read complete after 0s [id=/subscriptions/00c849a4-d8b3-4d56-95fe-9a2d0bb40e69/resourceGroups/rg-team-1-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.prefix will be created
  + resource "random_id" "prefix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.aks.azapi_update_resource.aks_cluster_post_create will be created
  + resource "azapi_update_resource" "aks_cluster_post_create" {
      + body                    = jsonencode(
            {
              + properties = {
                  + kubernetesVersion = null
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.ContainerService/managedClusters@2023-01-02-preview"
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = false
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = (known after apply)
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "germanywestcentral"
      + name                                = (known after apply)
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = false
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-team-1-dev"
      + role_based_access_control_enabled   = false
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + default_node_pool {
          + enable_auto_scaling    = false
          + enable_host_encryption = false
          + enable_node_public_ip  = false
          + kubelet_disk_type      = (known after apply)
          + max_pods               = (known after apply)
          + name                   = "nodepool"
          + node_count             = 2
          + node_labels            = (known after apply)
          + orchestrator_version   = (known after apply)
          + os_disk_size_gb        = 60
          + os_disk_type           = "Managed"
          + os_sku                 = (known after apply)
          + scale_down_mode        = "Delete"
          + type                   = "VirtualMachineScaleSets"
          + ultra_ssd_enabled      = false
          + vm_size                = "Standard_D2s_v3"
          + workload_runtime       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.aks.null_resource.kubernetes_cluster_name_keeper will be created
  + resource "null_resource" "kubernetes_cluster_name_keeper" {
      + id       = (known after apply)
      + triggers = {
          + "name" = (known after apply)
        }
    }

  # module.aks.null_resource.kubernetes_version_keeper will be created
  + resource "null_resource" "kubernetes_version_keeper" {
      + id       = (known after apply)
      + triggers = {
          + "version" = null
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/aks/main.tf line 548, in resource "azurerm_kubernetes_cluster" "main":
 548:       public_network_access_enabled,

The attribute "public_network_access_enabled" is deprecated. Refer to the
provider documentation for details.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @akowasch, Action: `pull_request`*